readme.org
#+qiita_private: bf2689a40f6e2816d606
#+OPTIONS: ^:{}
#+STARTUP: indent nolineimages overview num
#+TITLE: d10 6/15 docx
#+subtitle: markdown, pandoc, docx, hyperbolic discount(双曲割引)
#+AUTHOR: Shigeto R. Nishitani
#+EMAIL:     (concat "shigeto_nishitani@mac.com")
#+LANGUAGE:  jp
#+OPTIONS:   H:4 toc:t num:2
#+TAG: markdown, Pandoc, report, 双曲割引
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/html-theme-readtheorg.setup

* VSCode, html, md
memoをとるにはvscode + mdが決め手です．
vscodeには，mdをpreviewする機能があります．
文字，絵，数式などを簡単に編集することが可能です．

- MarkDown <-> html (WYSIWYG)
- [[https://qiita.com/oreo/items/82183bfbaac69971917f][Markdown記法一覧]]
- [[https://gist.github.com/higeknuckle/c9b2dac43fffa3ae0774e148a69a2e6b][Markdownチートシート]]
  
* レポート
「report ==  正しい引用 + format(体裁) 」です．
** 剽窃と引用
- [[https://kwanseio365-my.sharepoint.com/:b:/g/personal/cru32369_nuc_kwansei_ac_jp/Edel35ir5tVHur-rJt3hN58BIueXisBxrCVOCY9rssOM9g?e=xgz38W][理科系の作文技術(木下是雄)，「意見と事実」]]
- [[https://kwanseio365-my.sharepoint.com/:b:/g/personal/cru32369_nuc_kwansei_ac_jp/ETxjRkWsYitBqGPqWY88mYEB-fS_lY82o-7oyY4ljGF_8Q?e=UG78dg][剽窃と引用(理工学部からの通達)]]
** [[https://qiita.com/daddygongon/items/3373e54f1538036d0cf4][レポートの体裁]] 

* 題材 :: 双曲性ってなに？
# - [[https://qiita.com/daddygongon/items/5d68a28202b43b4dcc04][恐怖のマシュマロテスト]]
** [[https://kwanseio365-my.sharepoint.com/:b:/g/personal/cru32369_nuc_kwansei_ac_jp/EYhd0TQqO3hItmsrQWkKYb4BqOFOrVws_XWWJusX4AZJ_Q?e=7a62NY][池田の日経記事]]
** OSSの便利ツールpandoc
Markdownからdocxへの変換ツールpandocのinstallと使用例です．
#+begin_src shell
> sudo apt install pandoc
> pandoc hyperbolic_discount.md --from=markdown --to=docx --output=hyperbolic_discount.docx
> open hyperbolic_discount.docx
#+end_src

さらにreference.docxという書式フォーマットを提供するdocxを
作っておいてそれに合わせるやり方です(付録参照)．
: > pandoc hyperbolic_discount.md --from=markdown --to=docx --standalone --reference-doc=reference.docx --output=sample.docx

* 課題
1. 題目 : 双曲割引についてのレポートをdocxで仕上げてください．
1. 議論 : 自分の「続ける工夫」を書き加えて，
1. 体裁 : Reportの体裁にしてLUNAへpdfで提出してください．

