readme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="jp" xml:lang="jp">
<head>
<!-- 2026-06-15 Mon 09:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>d10 6/15 docx</title>
<meta name="author" content="Shigeto R. Nishitani" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/code-copy.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">d10 6/15 docx
<br />
<span class="subtitle">markdown, pandoc, docx, hyperbolic discount(双曲割引)</span>
</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga69cf62">1. VSCode, html, md</a></li>
<li><a href="#org3df4c6f">2. レポート</a>
<ul>
<li><a href="#org0ec604a">2.1. 剽窃と引用</a></li>
<li><a href="#org0cbe345">2.2. レポートの体裁</a></li>
</ul>
</li>
<li><a href="#org6b0eb16">3. 題材 :: 双曲性ってなに？</a>
<ul>
<li><a href="#orgf956c05">3.1. 池田の日経記事</a></li>
<li><a href="#org32829c7">3.2. OSSの便利ツールpandoc</a></li>
</ul>
</li>
<li><a href="#orgf223920">4. 課題</a></li>
</ul>
</div>
</div>
<div id="outline-container-orga69cf62" class="outline-2">
<h2 id="orga69cf62"><span class="section-number-2">1.</span> VSCode, html, md</h2>
<div class="outline-text-2" id="text-1">
<p>
memoをとるにはvscode + mdが決め手です．
vscodeには，mdをpreviewする機能があります．
文字，絵，数式などを簡単に編集することが可能です．
</p>

<ul class="org-ul">
<li>MarkDown &lt;-&gt; html (WYSIWYG)</li>
<li><a href="https://qiita.com/oreo/items/82183bfbaac69971917f">Markdown記法一覧</a></li>
<li><a href="https://gist.github.com/higeknuckle/c9b2dac43fffa3ae0774e148a69a2e6b">Markdownチートシート</a></li>
</ul>
</div>
</div>
<div id="outline-container-org3df4c6f" class="outline-2">
<h2 id="org3df4c6f"><span class="section-number-2">2.</span> レポート</h2>
<div class="outline-text-2" id="text-2">
<p>
「report ==  正しい引用 + format(体裁) 」です．
</p>
</div>
<div id="outline-container-org0ec604a" class="outline-3">
<h3 id="org0ec604a"><span class="section-number-3">2.1.</span> 剽窃と引用</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li><a href="https://kwanseio365-my.sharepoint.com/:b:/g/personal/cru32369_nuc_kwansei_ac_jp/Edel35ir5tVHur-rJt3hN58BIueXisBxrCVOCY9rssOM9g?e=xgz38W">理科系の作文技術(木下是雄)，「意見と事実」</a></li>
<li><a href="https://kwanseio365-my.sharepoint.com/:b:/g/personal/cru32369_nuc_kwansei_ac_jp/ETxjRkWsYitBqGPqWY88mYEB-fS_lY82o-7oyY4ljGF_8Q?e=UG78dg">剽窃と引用(理工学部からの通達)</a></li>
</ul>
</div>
</div>
<div id="outline-container-org0cbe345" class="outline-3">
<h3 id="org0cbe345"><span class="section-number-3">2.2.</span> <a href="https://qiita.com/daddygongon/items/3373e54f1538036d0cf4">レポートの体裁</a></h3>
</div>
</div>
<div id="outline-container-org6b0eb16" class="outline-2">
<h2 id="org6b0eb16"><span class="section-number-2">3.</span> 題材 :: 双曲性ってなに？</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgf956c05" class="outline-3">
<h3 id="orgf956c05"><span class="section-number-3">3.1.</span> <a href="https://kwanseio365-my.sharepoint.com/:b:/g/personal/cru32369_nuc_kwansei_ac_jp/EYhd0TQqO3hItmsrQWkKYb4BqOFOrVws_XWWJusX4AZJ_Q?e=7a62NY">池田の日経記事</a></h3>
</div>
<div id="outline-container-org32829c7" class="outline-3">
<h3 id="org32829c7"><span class="section-number-3">3.2.</span> OSSの便利ツールpandoc</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Markdownからdocxへの変換ツールpandocのinstallと使用例です．
</p>
<div class="org-src-container">
<pre class="src src-shell">&gt; sudo apt install pandoc
&gt; pandoc hyperbolic_discount.md --from=markdown --to=docx --output=hyperbolic_discount.docx
&gt; open hyperbolic_discount.docx
</pre>
</div>

<p>
さらにreference.docxという書式フォーマットを提供するdocxを
作っておいてそれに合わせるやり方です(付録参照)．
</p>
<pre class="example">
&gt; pandoc hyperbolic_discount.md --from=markdown --to=docx --standalone --reference-doc=reference.docx --output=sample.docx
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf223920" class="outline-2">
<h2 id="orgf223920"><span class="section-number-2">4.</span> 課題</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>題目 : 双曲割引についてのレポートをdocxで仕上げてください．</li>
<li>議論 : 自分の「続ける工夫」を書き加えて，</li>
<li>体裁 : Reportの体裁にしてLUNAへpdfで提出してください．</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shigeto R. Nishitani</p>
<p class="date">Created: 2026-06-15 Mon 09:02</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
